nxp-mcuxpresso/mcux-sdk/devices/MIMXRT758S/drivers/romapi/nboot/fsl_romapi_nboot.h
typedef struct _nboot_rot_auth_parms
{
    /* trusted information originated from CFPA */
    nboot_root_key_revocation_t soc_rootKeyRevocation[NBOOT_ROOT_CERT_COUNT]; /*!< Provided by caller based on NVM
                                                                                 information in CFPA: ROTKH_REVOKE */
    uint32_t soc_imageKeyRevocation; /*!< Provided by caller based on NVM information in CFPA: IMAGE_KEY_REVOKE */

    /* trusted information originated from CMPA */
    uint32_t soc_rkh[12];          /*!< Provided by caller based on NVM information in CMPA: ROTKH (hash of hashes) */
                                   /*!< In case of kNBOOT_RootKey_Ecdsa_P384, sock_rkh[0..11] are used */
                                   /*!< In case of kNBOOT_RootKey_Ecdsa_P256, sock_rkh[0..7] are used */

    uint32_t soc_numberOfRootKeys; /* unsigned int, between minimum = 1 and maximum = 4; */
    nboot_root_key_usage_t soc_rootKeyUsage[NBOOT_ROOT_CERT_COUNT]; /* CMPA */
    nboot_root_key_type_and_length_t
        soc_rootKeyTypeAndLength; /* static selection between ECDSA P-256 or ECDSA P-384 based root keys */

    /* trusted information originated from OTP fuses */
    nboot_soc_lifecycle_t soc_lifecycle;
} nboot_rot_auth_parms_t;

typedef struct _nboot_sb3_load_manifest_parms
{
    nboot_rot_auth_parms_t soc_RoTNVM;   /*! trusted information originated from CFPA and NMPA */
    uint32_t soc_trustedFirmwareVersion; /*!< Provided by caller based on NVM information in CFPA: Secure_FW_Version */
    uint8_t pckBlob[48];
} nboot_sb3_load_manifest_parms_t;

typedef struct _nboot_img_auth_ecdsa_parms
{
    /* trusted information originated from CFPA and NMPA */
    nboot_rot_auth_parms_t soc_RoTNVM;

    uint32_t soc_trustedFirmwareVersion; /*!< Provided by caller based on NVM information in CFPA: Secure_FW_Version */
} nboot_img_auth_ecdsa_parms_t;

typedef struct _nboot_cmac_authenticate_parms
{
    uint32_t expectedMAC[4]; /*!< expected MAC result */
} nboot_img_authenticate_cmac_parms_t;

typedef struct nboot_sb3_context_t
{
    uint8_t kblk;                                     /*! reference into the nboot key table for used kblk */
    uint32_t expectedHashLen;                         /*! Length of expected hash of next block */
    uint8_t expectedHash[NXPCLSB3_MAX_DIGEST_LENGTH]; /*! Expected hash of next block */
} nboot_sb3_context_t;

/*!
 * @brief NBOOT context type
 *
 * This type defines the NBOOT context
 *
 */
typedef struct _nboot_context
{
    uint32_t totalBlocks; /*!< holds number of SB3 blocks. Initialized by nboot_sb3_load_header(). */
    uint32_t processData; /*!< flag, initialized by nboot_sb3_load_header().
                             SB3 related flag set by NBOOT in case the nboot_sb3_load_block()
                             provides plain data to output buffer (for processing by ROM SB3 loader */
    uint32_t timeout;     /*!< timeout value for css operation. In case it is 0, infinite wait is performed */
    uint32_t keyinfo[NBOOT_KEYINFO_WORDLEN]; /*!< data for NBOOT key management. */
    nboot_sb3_context_t
        sb3; /*!< state for stateful SB3 APIs, shared between nboot_sb3_load_manifest and nboot_sb3_load_block */
    uint32_t uuid[4];           /*!< holds UUID value from NMPA */
    uint32_t prngReadyFlag;     /*!< flag, used by nboot_rng_generate_lq_random() to determine whether CSS is ready to
                                   generate rnd number */
    uint32_t oemShareValidFlag; /*!< flag, used during TP to determine whether valid oemShare was set by
                                   nboot_tp_isp_gen_oem_master_share() */
    uint32_t oemShare[8]; /*!< buffer to store OEM_SHARE computed by nxpCLTrustProv_nboot_isp_gen_oem_master_share()
                               Only first 128-bits are actually used, but since CSS always uses 256-bit key shares,
                               remaining data must be zero filled. Pointer to this buffer is used as input to CSS during
                             KEYPROV */
    nboot_secure_counter_t secureCounter; /*!< Secure counter used by nboot */
    uint32_t rtf[NBOOT_GET_WORDLEN_FROM_BYTELEN(NBOOT_CONTEXT_RUNTIME_FINGERPRINT_BYTELEN)];
    uint32_t imageHash[48 / sizeof(uint32_t)];
    uint32_t authStatus;
    uint32_t disableProvisioningFirmwareNXP;
    uint32_t cryptolib_multipartCmacContext[NBOOT_GET_WORDLEN_FROM_BYTELEN(
        NBOOT_CONTEXT_CRYPTOLIB_MULTIPART_CMAC_CONTEXT_BYTELEN)];
} nboot_context_t;

/*!
 * @brief NBOOT type for an ECC coordinate
 *
 * This type defines the NBOOT ECC coordinate type
 *
 */
typedef uint8_t
    nboot_ecc_coordinate_t[NBOOT_EC_COORDINATE_MAX_SIZE]; /*!ECC point coordinate, up to 384-bits. big endian. */

/*!
 * @brief NBOOT type for an ECC signature
 *
 * This type defines the NBOOT ECC signature type
 *
 */
typedef struct
{
    nboot_ecc_coordinate_t r; /*! r portion of the ECDSA signature, up to 384-bits. big endian. */
    nboot_ecc_coordinate_t s; /*! s portion of the ECDSA signature, up to 384-bits. big endian. */
} nboot_ecdsa_signature_t;

/*!
 * @brief NBOOT type for an ECC point
 *
 * This type defines the NBOOT ECC point type
 *
 */
typedef struct
{
    nboot_ecc_coordinate_t x; /*! x portion of the ECDSA public key, up to 384-bits. big endian. */
    nboot_ecc_coordinate_t y; /*! y portion of the ECDSA public key, up to 384-bits. big endian. */
} nboot_ecdsa_public_key_t;

typedef uint8_t nboot_ctrk_hash_t[NBOOT_ROOT_OF_TRUST_HASH_SIZE_IN_BYTES];

/*!
 * @brief NBOOT type for the hash table
 *
 * This type defines the NBOOT hash table
 *
 */
typedef struct _nboot_ctrk_hash_table
{
    nboot_ctrk_hash_t ctrkHashTable[NBOOT_ROOT_CERT_COUNT];
} nboot_ctrk_hash_table_t;

/*!
 * @brief NBOOT type for the isk block
 *
 * This type defines the constant length part of an NBOOT isk block
 *
 */
typedef struct
{
    uint32_t signatureOffset; /*! Offset of signature in ISK block. */
    uint32_t constraints;     /*! Version number of signing certificate. */
    uint32_t iskFlags;        /*! Reserved for definiton of ISK certificate flags. */
    nboot_ecdsa_public_key_t
        iskPubKey; /*! Public key of signing certificate. Variable length; only used to determine start address*/
    nboot_ecdsa_public_key_t userData; /*! Space for at lest one addition public key*/
    nboot_ecdsa_signature_t iskSign;   /*! ISK signature*/
} nboot_isk_block_t;

/*!
 * @brief NBOOT type for the root certificate block
 *
 * This type defines the NBOOT root certificate block, it is part of the nboot_certificate_block_t
 *
 */
typedef struct _nboot_root_certificate_block
{
    uint32_t flags;                         //!< root certificate flags
    nboot_ctrk_hash_table_t ctrkHashTable;  //!< hash table
    nboot_ecdsa_public_key_t rootPublicKey; //!< root public key
} nboot_root_certificate_block_t;

/*!
 * @brief NBOOT type for the header of the certificate block
 *
 * This type defines the NBOOT header of the certificate block, it is part of the nboot_certificate_block_t
 *
 */
typedef struct _nboot_certificate_header_block
{
    uint32_t magic;                   //!< magic number.
    uint32_t formatMajorMinorVersion; //!< format major minor version
    uint32_t certBlockSize;           //!< Size of the full certificate block
} nboot_certificate_header_block_t;

/*!
 * @brief NBOOT type for the certificate block
 *
 * This type defines the constant length part of an NBOOT certificate block
 *
 */
typedef struct _nboot_certificate_block
{
    nboot_certificate_header_block_t header;
    nboot_root_certificate_block_t rootCertBlock; /*! Details of selected root certificate (root certificate which will
                                                     be used for ISK signing/SB3 header signing) */
    nboot_isk_block_t iskBlock;
} nboot_certificate_block_t;

typedef struct
{
    nboot_status_t (*nboot_context_init)(nboot_context_t *context);
    nboot_status_t (*nboot_context_deinit)(nboot_context_t *context);
    nboot_status_protected_t (*nboot_sb3_load_manifest)(nboot_context_t *context,
                                                        uint32_t *manifest,
                                                        nboot_sb3_load_manifest_parms_t *parms);
    nboot_status_protected_t (*nboot_sb3_load_block)(nboot_context_t *context, uint32_t *block);
    nboot_status_protected_t (*nboot_sb3_check_authenticity_and_completeness)(nboot_context_t *context,
                                                                              uint32_t *address,
                                                                              nboot_sb3_load_manifest_parms_t *parms);
    nboot_status_protected_t (*nboot_img_authenticate_ecdsa)(nboot_context_t *context,
                                                             uint8_t imageStartAddress[],
                                                             nboot_bool_t *isSignatureVerified,
                                                             nboot_img_auth_ecdsa_parms_t *parms);
    nboot_status_protected_t (*nboot_img_authenticate_cmac)(nboot_context_t *context,
                                                            uint8_t imageStartAddress[],
                                                            nboot_bool_t *isSignatureVerified,
                                                            nboot_img_authenticate_cmac_parms_t *parms);
} nboot_interface_t;

