nxp-mcuxpresso/mcux-sdk/devices/MIMXRT758S/drivers/romapi/nboot/fsl_romapi_nboot.h
/*******************************************************************************
 * API
 ******************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief The function is used for initializing of the nboot context data structure.
 *        It should be called prior to any other calls of nboot API.
 *
 * @param nbootCtx Pointer to nboot_context_t structure.
 *
 * @retval #kStatus_NBOOT_Success Operation successfully finished
 * @retval #kStatus_NBOOT_Fail Error occured during operation
 */
nboot_status_t NBOOT_ContextInit(nboot_context_t *context);

/*!
 * @brief The function is used to deinitialize nboot context data structure.
 * Its contents are overwritten with random data so that any sensitive data does not remain in memory.
 *
 * @param context Pointer to nboot_context_t structure.

 * @retval #kStatus_NBOOT_Success Operation successfully finished
 * @retval #kStatus_NBOOT_Fail Error occured during operation
 */
nboot_status_t NBOOT_ContextDeinit(nboot_context_t *context);

/*!
 * @brief Verify NBOOT SB3.1 manifest (header message)
 *
 * This function verifies the NBOOT SB3.1 manifest (header message), initializes
 * the context and loads keys into the CSS key store so that they can be used by nboot_sb3_load_block
 * function. The NBOOT context has to be initialized by the function nboot_context_init before calling
 * this function. Please note that this API is intended to be used only by users who needs to split
 * FW update process (loading of SB3.1 file) to partial steps to customize whole operation.
 * For regular SB3.1 processing, please use API described in chapter KB APIs.
 *
 * @param nbootCtx Pointer to nboot_context_t structure.
 * @param manifest Pointer to the input manifest buffer
 * @param params additional input parameters. Please refer to nboot_sb3_load_manifest_parms_t definition for details.
 *
 * @retval #kStatus_NBOOT_Success Operation successfully finished
 * @retval #kStatus_NBOOT_Fail Error occured during operation
 */
nboot_status_protected_t NBOOT_Sb3LoadManifest(nboot_context_t *context,
                                               uint32_t *manifest,
                                               nboot_sb3_load_manifest_parms_t *parms);

/*!
 * @brief Verify NBOOT SB3.1 block
 *
 * This function verifies and decrypts an NBOOT SB3.1 block. Decryption is performed in-place.
 * The NBOOT context has to be initialized by the function nboot_context_init before calling this function.
 * Please note that this API is intended to be used only by users who needs to split FW update process
 * (loading of SB3.1 file) to partial steps to customize whole operation. For regular SB3.1 processing,
 * please use API described in KB APIs.
 *
 * @param context Pointer to nboot_context_t structure.
 * @param block Pointer to the input SB3.1 data block
 *
 * @retval #kStatus_NBOOT_Success successfully finished
 * @retval #kStatus_NBOOT_Fail occured during operation
 */
nboot_status_protected_t NBOOT_Sb3LoadBlock(nboot_context_t *context, uint32_t *block);

/*!
 * @brief This function verifies and decrypts an NBOOT SB3.1 block. Decryption is performed in-place.The NBOOT context
 * has to be initialized by the function nboot_context_init before calling this function.
 *
 * @param context Pointer to nboot_context_t structure.
 * @param address Pointer to start of the image in memory
 * @param parms Pointer to a data structure in trusted memory
 *
 * @retval #kStatus_NBOOT_Success successfully finished
 * @retval #kStatus_NBOOT_Fail occured during operation
 */
nboot_status_protected_t NBOOT_Sb3CheckAuthenticityAndCompleteness(nboot_context_t *context,
                                                                   uint32_t *address,
                                                                   nboot_sb3_load_manifest_parms_t *parms);

/*!
 * @brief This function authenticates image with asymmetric cryptography.
 *        The NBOOT context has to be initialized by the function nboot_context_init
 *        before calling this function.
 *
 * @param context Pointer to nboot_context_t structure.
 * @param imageStartAddress Pointer to start of the image in memory.
 * @param isSignatureVerified Pointer to memory holding function call result.
 *                            After the function returns, the value will be set to kNBOOT_TRUE when the image is
 * authentic. Any other value means the authentication does not pass.
 *
 * @param parms Pointer to a data structure in trusted memory, holding input parameters for the algorithm.
 *              The data structure shall be correctly filled before the function call.
 *
 * @retval #kStatus_NBOOT_Success Operation successfully finished
 * @retval #kStatus_NBOOT_Fail Returned in all other cases. Doesn't always mean invalid image,
 *         it could also mean transient error caused by short time environmental conditions.
 */
nboot_status_protected_t NBOOT_ImgAuthenticateEcdsa(nboot_context_t *context,
                                                    uint8_t imageStartAddress[],
                                                    nboot_bool_t *isSignatureVerified,
                                                    nboot_img_auth_ecdsa_parms_t *parms);

/*!
 * @brief This function calculates the CMAC over the given image and compares it to the expected value.
 * To be more resistant against SPA, it is recommended that imageStartAddress is word aligned.
 * The NBOOT context has to be initialized by the nboot_context_init() before calling this function.
 *
 * @param context Pointer to nboot_context_t structure.
 * @param imageStartAddress Pointer to start of the image in memory.
 * @param isSignatureVerified Pointer to memory holding function call result.
                              After the function returns, the value will be set to
 * @param parms Pointer to a data structure in trusted memory, holding the reference MAC.
                The data structure shall be correctly filled before the function call.
 *
 * @retval kStatus_NBOOT_Success
 * @retval kStatus_NBOOT_Fail
 */
nboot_status_protected_t NBOOT_ImgAuthenticateCmac(nboot_context_t *context,
                                                   uint8_t imageStartAddress[],
                                                   nboot_bool_t *isSignatureVerified,
                                                   nboot_img_authenticate_cmac_parms_t *parms);

#endif /* FSL_ROMAPI_NBOOT_H_ */
